HankB/esp8266_MQTT_BME280/src/main.cpp
/*
 Basic ESP8266 MQTT example ... now heavily modified.
 - Associate with AP and connect to MQTT broker.

 Alternatives
  Subscribe to an NTP server and be independant of the other
  process publishing the message.
*/

#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <Wire.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#include "time.h"

#include "secrets.h"
/* secrets.h should define the following as appropriate for your network.
const char* ssid = "...";
const char* password = "...";
const char* mqtt_server = "host.domain"; // "<host>.localddomain" works for me.
*/

#define serial_IO 1 // control compilation of serial I/O
// NOTE: currently turning off Serial I/O results in an app that does not work.

WiFiClient espClient;
PubSubClient mqttClient(espClient);
unsigned long lastMsg = 0;
#define MSG_BUFFER_SIZE (200)
char payload[MSG_BUFFER_SIZE];
Adafruit_BME280 bme; // I2C
String hostname = "who-me?";
String topic;

void setup_wifi()
{

  delay(10);
  // We start by connecting to a WiFi network
#if serial_IO
  Serial.println();
  Serial.print("Connecting to ");
  Serial.println(ssid);
#endif

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);

  while (WiFi.status() != WL_CONNECTED)
  {
#if serial_IO
    delay(500);
    Serial.print(".");
#else
    digitalWrite(LED_BUILTIN, LOW); // Turn the LED on
    delay(100);
    digitalWrite(LED_BUILTIN, HIGH); // Turn the LED off
    delay(400);
#endif
    // build topic
    hostname = WiFi.hostname();
    topic = "HA/" + hostname + "/lab/temp_humidity_press";
  }

  randomSeed(micros());

#if serial_IO
  Serial.println("");
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(topic);
#endif
}

void setup_BME280(void)
{
  // configure BME280/I2C
  Wire.begin(D3, D4); // Make sure you have D3 & D4 hooked up to the BME280
  Wire.setClock(100000);
  unsigned status = bme.begin(0x76);
  if (!status)
  {
#if serial_IO
    Serial.println("Could not find a valid BME280 sensor, check wiring, address, sensor ID!");
    Serial.print("SensorID was: 0x");
    Serial.println(bme.sensorID(), 16);
    Serial.print("        ID of 0xFF probably means a bad address, a BMP 180 or BMP 085\n");
    Serial.print("   ID of 0x56-0x58 represents a BMP 280,\n");
    Serial.print("        ID of 0x60 represents a BME 280.\n");
    Serial.print("        ID of 0x61 represents a BME 680.\n");
    while (1)
      delay(10); // hard lockup - might be better to publish an error indicator.
#else
    while (1)
    {
      digitalWrite(LED_BUILTIN, LOW); // Turn the LED on
      delay(100);
      digitalWrite(LED_BUILTIN, HIGH); // Turn the LED off
      delay(90);
    }
#endif
  }
}

void reconnect()
{
  // Loop until we're reconnected
  while (!mqttClient.connected())
  {
#if serial_IO
    Serial.print("Attempting MQTT connection...");
#endif
    // Create a random client ID
    String clientId = "ESP8266Client-";
    clientId += String(random(0xffff), HEX);
    // Attempt to connect
    if (mqttClient.connect(clientId.c_str()))
    {
#if serial_IO
      Serial.println("MQTT connected");
#endif
    }
    else
    {
#if serial_IO
      Serial.print("failed, rc=");
      Serial.print(mqttClient.state());
      Serial.println(" try again in 5 seconds");
#endif
      // Wait 5 seconds before retrying
      digitalWrite(LED_BUILTIN, LOW); // Turn the LED on
      delay(20);
      digitalWrite(LED_BUILTIN, HIGH); // Turn the LED off
      delay(4980);
    }
  }
}

#if serial_IO > 1
void printValues(void)
{
  Serial.print("Temperature = ");
  Serial.print(bme.readTemperature());
  Serial.println(" °C");

  Serial.print("Pressure = ");
  Serial.print(bme.readPressure() / 100.0F);
  Serial.println(" hPa");

  Serial.print("Humidity = ");
  Serial.print(bme.readHumidity());
  Serial.println(" %");

  Serial.println();
}
#endif

// NTP server to request epoch time
const char *ntpServer = "pool.ntp.org";

// Variable to save current epoch time
unsigned long epochTime;

// Function that gets current epoch time
unsigned long getTime()
{
  time_t now;
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo))
  {
    // Serial.println("Failed to obtain time");
    return (0);
  }
  time(&now);
  return now;
}

void setup()
{
  pinMode(LED_BUILTIN, OUTPUT); // Initialize the LED_BUILTIN pin as an output
#if serial_IO
  Serial.begin(115200);
  while (!Serial)
    ; // time to get serial running
#endif
  setup_wifi();
  setup_BME280();
  mqttClient.setServer(mqtt_server, 1883);
  configTime(0, 0, ntpServer);
}

void loop()
{
  time_t curtime;

  if (!mqttClient.connected())
  {
    reconnect();
  }
  mqttClient.loop();

  curtime = time(0);

  if (curtime > 1772815188) // only publish once we have time sync
  {
    unsigned long now = millis();

    if ((lastMsg == 0) || (now - lastMsg > 1000 * 60))
    {
      lastMsg = now;

      // fetch heap stats
      uint32_t free;
      uint32_t max;
      uint8_t frag;
      ESP.getHeapStats(&free, &max, &frag);

      snprintf(payload, MSG_BUFFER_SIZE,
               "{\"t\":%lld, \"temp\":%.2f, \"press\":%.2f, \"humid\":%.2f, "
               "\"heap\":{\"free\":%7u, \"max\":%7u, \"frag\":%3d}, \"device\":\"BME280\"}",
               curtime, bme.readTemperature() / 5 * 9 + 32.0,
               bme.readPressure() / 100, bme.readHumidity(),
               free, max, frag);
      mqttClient.publish(topic.c_str(), payload);
#if serial_IO > 1
      Serial.print("Publish message: ");
      Serial.println(payload);
      printValues();
#endif
    }
    else
    {
      delay(1000);
    }
  }
  else
  {
#if serial_IO > 1
    Serial.println("waiting for NTP sync");
    delay(1000);
#endif
  }
}
